<a href="https://colab.research.google.com/github/hemu2510/Python--udemy-course-/blob/main/python_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
for x in range(1, 31):
    if x % 2 == 0:
        print (x, end = " ")
    else:
        print("Even", end = " ")

Even 2 Even 4 Even 6 Even 8 Even 10 Even 12 Even 14 Even 16 Even 18 Even 20 Even 22 Even 24 Even 26 Even 28 Even 30

In [ ]:
for x in range(1, 30):
    if x % 2 != 0:
        print (x, end = " ")
    else:
        print("Even", end = " ")

1 Even 3 Even 5 Even 7 Even 9 Even 11 Even 13 Even 15 Even 17 Even 19 Even 21 Even 23 Even 25 Even 27 Even 29

In [ ]:
n = [1,2,3,4,5,6]
for  num in n:
    print(num  * 10, end=" ")

10 20 30 40 50 60

In [ ]:
nums = [1,35,12,24,31,51,70,100]
def count(nums):
    total = 0
    for x in nums:
        if x < 20:
          total += 1
    count(nums)

In [ ]:
def count(nums):
    count = 0
    i = 0
    while i < len(nums):
        if nums[i] < 20:
            count += 1
        i += 1
    return count

In [ ]:
prices = {
    "box_of_spaghetti" : 4,
    "lasagna"  : 5,
    "hamburger" : 2
   }
quantity = {
    "box_of_spaghetti" : 6,
    "lasagna"  : 10,
    "hamburger" : 0
    }

money_spent = 5
for i in prices:
    money_spent = money_spent + (prices [i] * quantity[i])
print (money_spent)

79

In [ ]:
prices = {
    "box_of_spaghetti" : 4,
    "lasagna"  : 5,
    "hamburger" : 2
   }
quantity = {
    "box_of_spaghetti" : 6,
    "lasagna"  : 10,
    "hamburger" : 0
    }

def calculate_expenses(prices, quantity):
    total_spent = 0
    for product in prices:
        if prices[product] >= 5:
            total_spent += prices[product] * quantity[product]
    return total_spent

result = calculate_expenses(prices, quantity)
print(result)

50

In [ ]:
prices = {
    "box_of_spaghetti" : 4,
    "lasagna"  : 5,
    "hamburger" : 2
   }
quantity = {
    "box_of_spaghetti" : 6,
    "lasagna"  : 10,
    "hamburger" : 0
    }

money_spent = 0
for product in prices:
    if prices[product] < 5:
        money_spent += prices[product] * quantity[product]

print(money_spent)

24

In [ ]:
employee_names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
list(employee_names)

['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']

In [ ]:
import pandas as pd
employee_names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
employee_names_Series = pd.Series(employee_names)
print(type(employee_names_Series))

<class 'pandas.core.series.Series'>

In [ ]:
import pandas as pd
work_experience_yrs = pd.Series([5, 8, 3, 10])
print(work_experience_yrs)

0     5
1     8
2     3
3    10
dtype: int64

In [ ]:
import numpy as np

In [ ]:
import numpy as np
array_age = np.array([50, 53, 35, 43])
print(array_age)

[50 53 35 43]

In [ ]:
import numpy as numpy
array_age = np.array([50, 53, 35, 43])
type(array_age)

numpy.ndarray

In [ ]:
import pandas as pd
import numpy as np
array_age = np.array([50, 53, 35, 43])
series_age = pd.Series(array_age)
print(series_age)

0    50
1    53
2    35
3    43
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
array_age = np.array([50, 53, 35, 43])
series_age = pd.Series(array_age)
print(type(series_age))

<class 'pandas.core.series.Series'>

In [ ]:
import pandas as pd
work_experience_years = pd.Series([5, 8, 3, 10])
print(work_experience_years)

0     5
1     8
2     3
3    10
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
work_experience_years = np.array([5,8,3,10])
work_experience_array = pd.Series(work_experience_years)
print(work_experience_array)

0     5
1     8
2     3
3    10
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
work_experience_years = pd.Series([5,8,3,10])
work_experience_array = work_experience_years.to_numpy()
print(work_experience_array)

[ 5  8  3 10]

In [ ]:
import pandas as pd
import numpy as np
work_experience_years = pd.Series([5,8,3,10])
work_experience_array = work_experience_years.to_numpy()
print(type(work_experience_array))

<class 'numpy.ndarray'>

In [ ]:
import pandas as p
import numpy as np
work_experience_years = pd.Series([5,8,3,10])
print(work_experience_years.size)

4

In [ ]:
import pandas as pd
import numpy as np
work_experience_yrs = pd.Series([5,8,3,10])
work_experience_yrs.name = 'Work Experience (Yrs.)'
print(work_experience_yrs)

0     5
1     8
2     3
3    10
Name: Work Experience (Yrs.), dtype: int64

In [ ]:
import pandas as pd
import numpy as np
work_experience_years = pd.Series([5,8,3,10])
work_experience_years.name = "Work Experience (Yrs.)"
print(work_experience_yrs)

0     5
1     8
2     3
3    10
Name: Work Experience (Yrs.), dtype: int64

In [ ]:
import pandas as pd

work_experience_years = pd.Series([5,8,3,10])
work_experience_years.name = "Work Experience (Yrs.)"
print(work_experience_years)

0     5
1     8
2     3
3    10
Name: Work Experience (Yrs.), dtype: int64

In [ ]:
import pandas as pd
workers_age = {'Amy White' : 50, 'Jack Stewart' : 53, 'Richard Lauderdale' : 35, 'Sara Johnson' : 43}
print(workers_age)

{'Amy White': 50, 'Jack Stewart': 53, 'Richard Lauderdale': 35, 'Sara Johnson': 43}

In [ ]:
import pandas as pd
import numpy as np
workers_age = {'Amy White':50, 'Jack Stewart':53, 'Richard Lauderdale':35, 'Sara Johnson':43}
print(workers_age)

{'Amy White': 50, 'Jack Stewart': 53, 'Richard Lauderdale': 35, 'Sara Johnson': 43}

In [ ]:
import pandas as pd

workers_age = {'Amy White':50, 'Jack Stewart':53, 'Richard Lauderdale':35, 'Sara Johnson':43}
workers_age_series = pd.Series(workers_age)
print(worker_age_series)

NameError: name 'worker_age_series' is not defined

In [ ]:
import pandas as pd
import numpy as np
workers_age = {
    'Amy White':50,
    'Jack Stewart':53,
    'Richard Lauderdale':35,
    'Sara Johnson':43

}

print(workers_age)

{'Amy White': 50, 'Jack Stewart': 53, 'Richard Lauderdale': 35, 'Sara Johnson': 43}

In [ ]:
import pandas as pd
workers_age = pd.Series([50, 53, 35, 43], index=["Amy White", "Jack Stewart", "Richard Lauderdale", "Sara Johnson"])
index_of_workers_age = workers_age.index
print(index_of_workers_age)

Index(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], dtype='object')

In [ ]:
employees_work_exp = {'Martin': 8, 'George': 5}
employees_work_exp

{'Martin': 8, 'George': 5}

In [ ]:
import pandas as pd
employees_work_exp = {
    'Martin': 8,
    'George': 5

}
employees_work_exp = pd.Series(employees_work_exp)
print(employees_work_exp)

Martin    8
George    5
dtype: int64

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({'Martin':8, 'George':5})
employees_work_exp.index

Index(['Martin', 'George'], dtype='object')

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({'Martin':8, 'George':5})
index_of_employees_work_exp = employees_work_exp.index
print(index_of_employees_work_exp)

Index(['Martin', 'George'], dtype='object')

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({'Martin':8, 'George':5})
employees_work_exp.index[0]

TypeError: type 'Index' is not subscriptable

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({'Martin':8, 'George':5})
first_index_value = employees_work_exp.index[0]
print(first_index_value)
print(type(first_index_value))

Martin
<class 'str'>

In [ ]:
import numpy as np
series_age = np.array([44, 54, 65,35])
series_age_array = pd.Series(series_age)
print(series_age_array)

0    44
1    54
2    65
3    35
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
series_age = pd.Series(np.array([44,54,65,35]))
print(series_age)

0    44
1    54
2    65
3    35
dtype: int64

In [ ]:
import pandas as pd
import numpy as np

series_age = pd.Series(np.array([44, 54, 65, 35]))
index_of_series_age = series_age.index
print(index_of_series_age)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
import pandas as pd
import numpy as np
series_age = pd.Series(np.array([44,54,65,35]))
index_of_series_age = series_age.index
print(index_of_series_age)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})
employees_work_exp.head()

Amy White              3.0
Jack Stewart           5.0
Richard Lauderdale     4.5
Sara Johnson          22.0
Patrick Adams         28.0
dtype: float64

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})
employees_work_exp.tail()

Daniel Lloyd          6.0
John Owen             1.5
Jennifer Phillips    10.0
Courtney Rogers       4.5
Anne Robinson         2.0
dtype: float64

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})
employees_work_exp.head(3)

Amy White             3.0
Jack Stewart          5.0
Richard Lauderdale    4.5
dtype: float64

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})
employees_work_exp.tail(4)

John Owen             1.5
Jennifer Phillips    10.0
Courtney Rogers       4.5
Anne Robinson         2.0
dtype: float64

In [ ]:
import pandas as pd

employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})
employees_work_exp.sum()

104.5

In [ ]:
import pandas as pd
data = {'Name':[ 'Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 'Age':[50, 53, 35, 43], 'WorkingExperience(Yrs.)':[5,8,3,10]}
df = pd.DataFrame(data)
print(df)[]

                 Name  Age  Working_Experience_(Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

In [ ]:
import pandas as pd
data = {'Name':['Army White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 'Age':[50,53,35,43], 'Working Experience(yrs.)':[5,8,3,10]}
df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experience(yrs.)
0          Army White   50                         5
1        Jack Stewart   53                         8
2  Richard Lauderdale   35                         3
3        Sara Johnson   43                        10

In [ ]:
import pandas as pd
names = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'])
age = pd. Series([50, 53, 35, 43])
working_experience_yrs = pd.Series([5,8,3,10])

data = {
    'Name' : names,
    'Age' : age,
    'Working Experience (Yrs.)' : working_experience_yrs
}
df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

In [ ]:
import pandas as pd
data = [
['Army White',50, 5],
['Jack Stewart',53, 8],
['Richard Lauderdale',35,3],
['Sara Johnson',43, 10]
]
df = pd.DataFrame(data, colums['Name', 'Age', 'Working Experience (Yrs.)'])
print(df)

NameError: name 'colums' is not defined

In [ ]:
import pandas as pd
data = {'name':['Amy White','Jack Stewart','Richard lauderdale','Sara Joshnson'], 'Age':[50,53,35,43], 'Working experience(Yrs.)':[5,8,3,10]}
df = pd.DataFrame(data)
print(df)

                 name  Age  Working experience(Yrs.)
0           Amy White   50                         5
1        Jack Stewart   53                         8
2  Richard lauderdale   35                         3
3       Sara Joshnson   43                        10

In [ ]:
import pandas as pd
data = {
    'Name':['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'],
    'Age':[50, 53, 35, 43],
    'Working Experience (Yrs.)':[5,8,3,10]

}
df = pd.DataFrame(data, index=[1,2,3,4])
print(df)

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10